{
  "nodes": [
    {
      "op": "null", 
      "name": "/dropout_1_input1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(0, 2048, 70)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_1/dropout2", 
      "attrs": {"p": "0.25"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims19", 
      "attrs": {"axis": "3"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L, 2048L, 3L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims21", 
      "attrs": {"axis": "3"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "model_1/conv1d_1/conv1d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3L, 1L)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attrs": {"shape": "(0L, 128L, 68L)"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attrs": {"shape": "(1, 128, 1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add7", 
      "inputs": [[6, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu7", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims31", 
      "attrs": {"axis": "2"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose20", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "model_1/max_pooling1d_1/pool2d2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(3, 1)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose21", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape31", 
      "attrs": {"shape": "(0L, 42L, 68L)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose35", 
      "attrs": {"axes": "[0, 2, 1]"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten11", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims23", 
      "attrs": {"axis": "3"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L, 2048L, 9L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims25", 
      "attrs": {"axis": "3"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "model_1/conv1d_2/conv1d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(9L, 1L)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape23", 
      "attrs": {"shape": "(0L, 128L, 62L)"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attrs": {"shape": "(1, 128, 1)"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add9", 
      "inputs": [[22, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu9", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims35", 
      "attrs": {"axis": "2"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose28", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "model_1/max_pooling1d_2/pool2d2", 
      "attrs": {
        "kernel": "(9, 1)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(9, 1)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose29", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attrs": {"shape": "(0L, 14L, 62L)"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose31", 
      "attrs": {"axes": "[0, 2, 1]"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten7", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims27", 
      "attrs": {"axis": "3"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_3/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L, 2048L, 19L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims29", 
      "attrs": {"axis": "3"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "model_1/conv1d_3/conv1d2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(19L, 1L)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape27", 
      "attrs": {"shape": "(0L, 128L, 52L)"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1d_3/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attrs": {"shape": "(1, 128, 1)"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add11", 
      "inputs": [[38, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu11", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.0"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims33", 
      "attrs": {"axis": "2"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose24", 
      "attrs": {"axes": "[0, 3, 1, 2]"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "model_1/max_pooling1d_3/pool2d2", 
      "attrs": {
        "kernel": "(19, 1)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(19, 1)"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose25", 
      "attrs": {"axes": "[0, 2, 3, 1]"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attrs": {"shape": "(0L, 6L, 52L)"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose33", 
      "attrs": {"axes": "[0, 2, 1]"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten9", 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[17, 0, 0], [33, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(4036L, 128L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_1/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add13", 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout_2/dropout2", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/kernel1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(128L, 5L)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot3", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense_2/bias1", 
      "attrs": {
        "__dtype__": "0", 
        "__shape__": "(5L,)", 
        "__storage_type__": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add15", 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[59, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    7, 
    19, 
    23, 
    35, 
    39, 
    51, 
    53, 
    56, 
    58
  ], 
  "node_row_ptr": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63
  ], 
  "heads": [[60, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10301]}
}